# ==========================================
# ЭТАП 1: Сборка (Builder)
# ==========================================
# Берем официальный образ Go (версии 1.22 на базе легкого Alpine Linux)
FROM golang:1.25-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Сначала копируем файлы зависимостей и скачиваем их
# Это нужно для кэширования, чтобы не качать либы при каждой сборке
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь остальной код
COPY . .

# КОМПИЛЯЦИЯ! 
# CGO_ENABLED=0 отключает C-зависимости, делая бинарник полностью автономным.
# GOOS=linux гарантирует, что файл соберется под Linux, даже если ты собираешь его на Windows.
RUN CGO_ENABLED=0 GOOS=linux go build -o uptime-tracker ./cmd/tracker/main.go


# ==========================================
# ЭТАП 2: Финальный образ (Production)
# ==========================================
# Берем абсолютно пустой и чистый образ Alpine Linux (весит ~5 МБ)
FROM alpine:latest

# Добавляем сертификаты (чтобы ТГ-бот мог отправлять HTTPS запросы) и таймзоны
RUN apk --no-cache add ca-certificates tzdata

WORKDIR /root/

# Копируем ТОЛЬКО готовый бинарник из первого этапа
COPY --from=builder /app/uptime-tracker .

# Копируем твой рабочий конфиг
COPY config.json .

# Говорим Докеру, что контейнер будет слушать порт 8080
EXPOSE 8080

# Команда, которая выполнится при старте контейнера
CMD ["./uptime-tracker"]